In [1]:
import pandas as pd

In [7]:
df = pd.read_csv('DataCaseDataset.csv',delimiter=";")

In [8]:
df.shape

(1470, 21)

In [9]:
df.columns

Index(['EmployeeID', 'Gender', 'Age', 'Education', 'EducationType',
       'MaritalStatus', 'TotalCompanies', 'TotalExperience',
       'DistanceToOffice', 'Department', 'Traveltype_last_year', 'BillingRate',
       'MonthlyIncome', 'Years_at_Company', 'Years_InCurrentRole',
       'LastSalaryHike', 'PotentialReview', 'PerformanceReview',
       'SatisfactionScore', 'JobRole_SatisfactionScore',
       'Overall_SatisfactionScore'],
      dtype='object')

In [10]:
df.head()

,EmployeeID,Gender,Age,Education,EducationType,MaritalStatus,TotalCompanies,TotalExperience,DistanceToOffice,Department,...,BillingRate,MonthlyIncome,Years_at_Company,Years_InCurrentRole,LastSalaryHike,PotentialReview,PerformanceReview,SatisfactionScore,JobRole_SatisfactionScore,Overall_SatisfactionScore
0,AB0001,Male,24.0,Graduation,Economics,Married,8.0,7.0,9.0,ClientSolutions,...,73.0,2718.00000,1.0,0.0,19,Very High,Met Expectations,Passive,Passive,Detractor
1,AB0002,Female,36.0,Masters / PHD,Economics,Single,8.0,22.0,2.0,ClientSolutions,...,36.0,6577.00000,20.0,9.0,15,Very High,Met Expectations,Detractor,Detractor,Promoter
2,AB0003,Male,33.0,Masters / PHD,Marketing / Finance,Divorced,NaN,8.0,24.0,ClientSolutions,...,28.0,2995.00000,7.0,5.0,18,Low,Met Expectations,Passive,Passive,Passive
3,AB0004,Male,21.0,Graduation,Marketing / Finance,Divorced,1.0,1.0,20.0,ClientSolutions,...,161.0,7162.36922,1.0,1.0,20,High,Exceed Expectations,Detractor,Passive,Passive
4,AB0005,Male,39.0,Graduation,Economics,Single,3.0,25.0,6.0,ClientSolutions,...,34.0,4674.00000,3.0,3.0,16,Medium,Met Expectations,Detractor,Passive,Promoter

In [35]:
df.describe()

,Age,TotalCompanies,TotalExperience,DistanceToOffice,BillingRate,MonthlyIncome,Years_at_Company,Years_InCurrentRole,LastSalaryHike
count,1461.000000,1453.000000,1455.000000,1421.000000,1445.000000,1461.000000,1252.000000,1279.000000,1461.000000
mean,31.290897,3.519615,14.426117,8.898100,102.505882,6745.796341,9.054313,5.533229,17.112936
std,8.530901,3.038854,9.382364,7.760044,53.391210,4110.165842,7.739582,4.651412,2.514120
min,16.000000,1.000000,1.000000,1.000000,12.000000,2342.350000,0.000000,0.000000,14.000000
25%,25.000000,1.000000,8.000000,2.000000,58.000000,3248.000000,4.000000,3.000000,15.000000
50%,30.000000,3.000000,13.000000,7.000000,101.000000,5503.000000,7.000000,4.000000,16.000000
75%,37.000000,5.000000,20.000000,14.000000,146.000000,8993.000000,13.000000,9.000000,19.000000
max,48.000000,10.000000,36.000000,26.600000,225.000000,15085.300000,52.000000,23.000000,24.000000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 21 columns):
EmployeeID                   1470 non-null object
Gender                       1465 non-null object
Age                          1466 non-null float64
Education                    1470 non-null object
EducationType                1470 non-null object
MaritalStatus                1470 non-null object
TotalCompanies               1462 non-null float64
TotalExperience              1464 non-null float64
DistanceToOffice             1429 non-null float64
Department                   1470 non-null object
Traveltype_last_year         1470 non-null object
BillingRate                  1454 non-null float64
MonthlyIncome                1470 non-null float64
Years_at_Company             1260 non-null float64
Years_InCurrentRole          1287 non-null float64
LastSalaryHike               1470 non-null int64
PotentialReview              1470 non-null object
PerformanceReview            1470 non-null object
SatisfactionScore            1470 non-null object
JobRole_SatisfactionScore    1470 non-null object
Overall_SatisfactionScore    1470 non-null object
dtypes: float64(8), int64(1), object(12)
memory usage: 241.3+ KB

## Check for outliers

In [23]:
import numpy as np

def outliers_iqr(ys):
    quartile_1 = ys.quantile(0.25)
    quartile_3 = ys.quantile(0.75)
    iqr = quartile_3 - quartile_1
    lower_bound = quartile_1 - (iqr * 1.5)
    upper_bound = quartile_3 + (iqr * 1.5)
    return np.where((ys > upper_bound) | (ys < lower_bound))

In [31]:
len(outliers_iqr(df['Years_InCurrentRole'])[0])

16

In [32]:
len(outliers_iqr(df['Years_at_Company'])[0])

53

In [33]:
df.dropna(subset=['Age','Gender'],inplace=True)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1461 entries, 0 to 1469
Data columns (total 21 columns):
EmployeeID                   1461 non-null object
Gender                       1461 non-null object
Age                          1461 non-null float64
Education                    1461 non-null object
EducationType                1461 non-null object
MaritalStatus                1461 non-null object
TotalCompanies               1453 non-null float64
TotalExperience              1455 non-null float64
DistanceToOffice             1421 non-null float64
Department                   1461 non-null object
Traveltype_last_year         1461 non-null object
BillingRate                  1445 non-null float64
MonthlyIncome                1461 non-null float64
Years_at_Company             1252 non-null float64
Years_InCurrentRole          1279 non-null float64
LastSalaryHike               1461 non-null int64
PotentialReview              1461 non-null object
PerformanceReview            1461 non-null object
SatisfactionScore            1461 non-null object
JobRole_SatisfactionScore    1461 non-null object
Overall_SatisfactionScore    1461 non-null object
dtypes: float64(8), int64(1), object(12)
memory usage: 251.1+ KB